app/controllers/on_taraf/anasayfa_controller.rb

SELECT "oyuns".* FROM "oyuns"
---
  def index
      @oyunlar=Oyun.all