app/controllers/on_taraf/oyundetay_controller.rb

  def index
      @oyun = Oyun.find(params[:id])
---
SELECT  "oyuns".* FROM "oyuns" WHERE "oyuns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]