app/controllers/oyuns_controller.rb

  def index
    @oyuns = Oyun.all
---
SELECT "oyuns".* FROM "oyuns"

  def create
    @oyun = Oyun.new(oyun_params)

    respond_to do |format|
      if @oyun.save
---
INSERT INTO "oyuns" ("isim", "aciklama", "created_at", "updated_at", "resim_file_name", "resim_content_type", "resim_file_size", "resim_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @oyun.update(oyun_params)
---
UPDATE "oyuns" SET "isim" = ?, "aciklama" = ?, "resim_file_name" = ?, "resim_file_size" = ?, "resim_updated_at" = ?, "updated_at" = ? WHERE "oyuns"."id" = ?

  def destroy
    @oyun.destroy
---
DELETE FROM "oyuns" WHERE "oyuns"."id" = ?  [["id", 5]]

    def set_oyun
      @oyun = Oyun.find(params[:id])
---
SELECT  "oyuns".* FROM "oyuns" WHERE "oyuns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]